modules/editors/emacs/cfg/config.el
;;; config.el --- -*- lexical-binding: t -*-

(elpaca no-littering
  (require 'no-littering))

(require 'savehist)
(require 'saveplace)
(require 'recentf)

(custom-set-variables
 '(savehist-save-minibuffer-history t)
 '(savehist-additional-variables '(kill-ring search-ring regexp-search-ring))
 '(recentf-max-menu-items 10)
 '(recentf-max-saved-items 20)
 '(recentf-auto-cleanup 100)
 '(history-length 25)
 '(savehist-mode t)
 '(save-place nil)
 '(recentf-mode t))

;; text properties severely bloat the history so delete them (courtesy of PythonNut)
(defun unpropertize-savehist ()
  (mapc (lambda (list)
          (with-demoted-errors
              (when (boundp list)
                (set list (mapcar #'substring-no-properties (eval list))))))
        '(kill-ring minibuffer-history helm-grep-history helm-ff-history file-name-history
                    read-expression-history extended-command-history)))
(add-hook 'kill-emacs-hook    #'unpropertize-savehist)
(add-hook 'savehist-save-hook #'unpropertize-savehist)

;; For my "settings" I prefer to use custom-set-variables, which does a bunch of neat stuff.
;; First, it calls a variable's "setter" function, if it has one.
;; Second, it can activate modes as well as set variables.
;; Third, it takes care of setting the default for buffer-local variables correctly.
;; https://with-emacs.com/posts/tutorials/almost-all-you-need-to-know-about-variables/#_user_options
;; https://old.reddit.com/r/emacs/comments/exnxha/withemacs_almost_all_you_need_to_know_about/fgadihl/
(custom-set-variables
 '(apropos-do-all t)
 '(echo-keystrokes 0.02)
 '(global-auto-revert-mode t)
 '(global-auto-revert-non-file-buffers t)
 '(mouse-yank-at-point t)
 '(track-eol t))

;; Allow some things that emacs would otherwise confirm.
(dolist (cmd
         '(eval-expression
           downcase-region
           upcase-region
           narrow-to-region
           set-goal-column
           dired-find-alternate-file))
  (put cmd 'disabled nil))

;; Make some buffers immortal
(defun my/immortal-buffers ()
  (if (or (eq (current-buffer) (get-buffer "*scratch*"))
          (eq (current-buffer) (get-buffer "*Messages*")))
      (progn (bury-buffer)
             nil)
    t))
(add-hook 'kill-buffer-query-functions 'my/immortal-buffers)

(elpaca general
  (require 'general)
  (general-override-mode)
  (general-auto-unbind-keys))

(elpaca-wait)

;; Unset annoying keys
(global-unset-key (kbd "C-z"))
(global-unset-key (kbd "C-x C-z"))
(global-unset-key (kbd "<kp-insert>"))
(global-unset-key (kbd "<insert>"))

;; for frequently used prefix keys, the user can create a custom definer with a
;; default :prefix
;; using a variable is not necessary, but it may be useful if you want to
;; experiment with different prefix keys and aren't using `general-create-definer'
(defconst my-leader "C-c")
(general-create-definer my-leader-def :prefix my-leader)

(defun xah-syntax-color-hex ()
  "Syntax color text of the form 「#ff1100」 and 「#abc」 in current buffer.
  URL `http://xahlee.info/emacs/emacs/emacs_CSS_colors.html'
  Version 2017-03-12"
  (interactive)
  (font-lock-add-keywords
   nil
   '(("#[[:xdigit:]]\\{3\\}"
      (0 (put-text-property
	  (match-beginning 0)
	  (match-end 0)
	  'face (list :background
		      (let* (
			     (ms (match-string-no-properties 0))
			     (r (substring ms 1 2))
			     (g (substring ms 2 3))
			     (b (substring ms 3 4)))
			(concat "#" r r g g b b))))))
     ("#[[:xdigit:]]\\{6\\}"
      (0 (put-text-property
	  (match-beginning 0)
	  (match-end 0)
	  'face (list :background (match-string-no-properties 0)))))))
  (font-lock-flush))

(defun xah-syntax-color-hsl ()
  "Syntax color CSS's HSL color spec eg 「hsl(0,90%,41%)」 in current buffer.
  URL `http://xahlee.info/emacs/emacs/emacs_CSS_colors.html'
  Version 2017-02-02"
  (interactive)
  (require 'color)
  (font-lock-add-keywords
   nil
   '(("hsl( *\\([0-9]\\{1,3\\}\\) *, *\\([0-9]\\{1,3\\}\\)% *, *\\([0-9]\\{1,3\\}\\)% *)"
      (0 (put-text-property
	  (+ (match-beginning 0) 3)
	  (match-end 0)
	  'face
	  (list
	   :background
	   (concat
	    "#"
	    (mapconcat
	     'identity
	     (mapcar
	      (lambda (x) (format "%02x" (round (* x 255))))
	      (color-hsl-to-rgb
	       (/ (string-to-number (match-string-no-properties 1)) 360.0)
	       (/ (string-to-number (match-string-no-properties 2)) 100.0)
	       (/ (string-to-number (match-string-no-properties 3)) 100.0)))
	     "" )) ;  "#00aa00"
	   ))))))
  (font-lock-flush))

(dolist (modes
	 '(css-mode-hook
	   emacs-lisp-mode-hook
	   php-mode-hook
	   html-mode-hook))
  (add-hook modes (lambda ()
		    (xah-syntax-color-hex)
		    (xah-syntax-color-hsl))))

(custom-set-variables
 ;; Cursor
 '(cursor-type 'box)
 '(hl-line-mode t)
 ;; Mouse
 '(blink-cursor-mode nil)
 '(mouse-avoidance-mode 'banish)
 '(mouse-wheel-scroll-amount
   '(1
     ((shift) . 5)
     ((meta) . 0.5)
     ((control) . text-scale)))
 '(mouse-drag-copy-region nil)
 '(make-pointer-invisible t)
 '(mouse-wheel-progressive-speed t)
 '(mouse-wheel-follow-mouse t)
 '(mouse-wheel-mode t)
 ;; Scrolling behaviour
 '(scroll-preserve-screen-position t)
 '(scroll-conservatively 1) ; affects `scroll-step'
 '(scroll-margin 8)
 '(next-screen-context-lines 0))

(elpaca fontify-face
  (fontify-face-mode))

;; Default Font
(set-face-attribute 'default nil :font "Fira Code" :height 80)
;; (set-face-attribute 'default nil :font "Cozette" :height 100)
;; Fixed Font Pitch
(set-face-attribute 'fixed-pitch nil :font "Fira Code" :height 80)
;; (set-face-attribute 'fixed-pitch nil :font "Cozette" :height 100)
;; Variable Font Pitch
(set-face-attribute 'variable-pitch nil :font "Fira Code" :height 80 :weight 'regular)
;; (set-face-attribute 'variable-pitch nil :font "Cozette" :height 100 :weight 'regular)

(elpaca all-the-icons)
(elpaca all-the-icons-dired)
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)

(elpaca keycast
  (keycast-mode-line-mode))

(custom-set-variables
 '(column-number-mode t)
 '(mode-line-percent-position '(-3 "%p"))
 '(mode-line-position-column-line-format '(" [%l , %c] "))
 '(mode-line-compact t)
 '(mode-line-format
   '("%e"
     mode-line-front-space
     mode-line-mule-info
     mode-line-client
     mode-line-modified
     mode-line-remote
     mode-line-frame-identification
     mode-line-buffer-identification
     "  "
     mode-line-position
     "  "
     (vc-mode vc-mode)
     ;; mode-line-modes
     mode-line-misc-info
     mode-line-end-spaces))
 ;; Keycast
 '(keycast-separator-width 2)
 '(keycast-mode-line-remove-tail-elements nil)
 '(keycast-mode-line-insert-after 'mode-line-end-spaces))

(with-eval-after-load 'keycast
  (dolist (input '(self-insert-command org-self-insert-command))
    (add-to-list 'keycast-substitute-alist `(,input "." "Typing…"))))

(elpaca gruber-darker-theme
  (load-theme 'gruber-darker t))
