modules/editors/emacs/cfg/config.el

(elpaca orderless)

(custom-set-variables
 '(orderless-component-separator " +")
 '(completion-category-defaults nil)
 '(completion-styles '(orderless flex initials partial-completion substring basic))
 '(completion-category-overrides '((file (styles basic substring)))))

(icomplete-mode 1)
(custom-set-variables
 '(icomplete-separator " • ")
 '(icomplete-vertical-mode nil)
 '(icomplete-delay-completions-threshold 0)
 '(icomplete-max-delay-chars 0)
 '(icomplete-compute-delay 0)
 '(icomplete-show-matches-on-no-input t)
 '(icomplete-hide-common-prefix nil)
 '(icomplete-in-buffer nil)
 '(icomplete-prospects-height 1)
 '(icomplete-with-completion-tables t)
 '(icomplete-tidy-shadowed-file-names nil)
 '(completions-format 'one-column)
 ;; '(completion-styles '(orderless partial-completion substring flex))
 ;; '(completion-category-overrides '((file (styles basic substring))
 ;;                                   (buffer (styles partial-completion initials flex)
 ;;                                           (cycle . 3))))
 )
(custom-set-faces
 `(icomplete-first-match ((t (:foreground "Green" :weight bold)))))

(general-define-key
 :keymaps 'icomplete-minibuffer-map
 "C-v" 'icomplete-vertical-mode
 "C-p" 'icomplete-backward-completions
 "C-n" 'icomplete-forward-completions
 "<tab>" 'icomplete-force-complete)

(elpaca (marginalia
	 :repo      "minad/marginalia"
	 :fetcher   github
	 :files    
	 (:defaults))
  (marginalia-mode))

(custom-set-variables
 '(marginalia-max-relative-age 0)
 '(marginalia-align 'left))

(elpaca (consult
         :repo      "minad/consult"
         :fetcher   github
         :files    
         (:defaults)))

(custom-set-variables
 '(register-preview-delay 0.5)
 '(register-preview-function #'consult-register-format)
 '(xref-show-xrefs-function #'consult-xref)
 '(xref-show-definitions-function #'consult-xref))

(with-eval-after-load 'consult
  (consult-customize
   consult-theme :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   ;; :preview-key "M-."
   :preview-key '(:debounce 0.4 any))
  ;; Optionally configure the narrowing key.
  ;; Both < and C-+ work reasonably well.
  (setq consult-narrow-key "<") ;; "C-+"

  (add-to-list 'consult-preview-allowed-hooks 'global-org-modern-mode-check-buffers)
  (add-to-list 'consult-preview-allowed-hooks 'global-hl-todo-mode-check-buffers)
  (add-hook 'completion-list-mode-hook #'consult-preview-at-point-mode))

;; Optionally tweak the register preview window.
;; This adds thin lines, sorting and hides the mode line of the window.
(advice-add #'register-preview :override #'consult-register-window)

(general-def global-map
 "C-x b" #'consult-buffer
 "M-g g" #'consult-line
 "C-M-l" #'consult-imenu)
(general-def minibuffer-local-map
 "C-r" #'consult-history)

(elpaca (embark
           :repo "oantolin/embark"
           :fetcher github
           :files (:defaults "embark.el" "embark-org.el" "embark.texi")))
(elpaca (embark-consult
           :repo "oantolin/embark"
           :fetcher github
           :files (:defaults "embark-consult.el")))

(setq embark-action-indicator
            (lambda (map &optional _target)
              (which-key--show-keymap "Embark" map nil nil 'no-paging)
              #'which-key--hide-popup-ignore-command)
            embark-become-indicator embark-action-indicator)
      ;; Hide the mode line of the Embark live/completions buffers
      (add-to-list 'display-buffer-alist
                   '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                     nil
                     (window-parameters (mode-line-format . none))))
(defun embark-which-key-indicator ()
    "An embark indicator that displays keymaps using which-key.
  The which-key help message will show the type and value of the
  current target followed by an ellipsis if there are further
  targets."
    (lambda (&optional keymap targets prefix)
      (if (null keymap)
          (which-key--hide-popup-ignore-command)
        (which-key--show-keymap
         (if (eq (plist-get (car targets) :type) 'embark-become)
             "Become"
           (format "Act on %s '%s'%s"
                   (plist-get (car targets) :type)
                   (embark--truncate-target (plist-get (car targets) :target))
                   (if (cdr targets) "…" "")))
         (if prefix
             (pcase (lookup-key keymap prefix 'accept-default)
               ((and (pred keymapp) km) km)
               (_ (key-binding prefix 'accept-default)))
           keymap)
         nil nil t (lambda (binding)
                     (not (string-suffix-p "-argument" (cdr binding))))))))

(setq embark-indicators
    '(embark-which-key-indicator
      embark-highlight-indicator
      embark-isearch-highlight-indicator))

  (defun embark-hide-which-key-indicator (fn &rest args)
    "Hide the which-key indicator immediately when using the completing-read prompter."
    (which-key--hide-popup-ignore-command)
    (let ((embark-indicators
           (remq #'embark-which-key-indicator embark-indicators)))
        (apply fn args)))

  (advice-add #'embark-completing-read-prompter
              :around #'embark-hide-which-key-indicator)

(with-eval-after-load 'embark
  (add-hook 'embark-collect-mode-hook 'consult-preview-at-point-mode))

(general-def global-map
 "M-]" #'embark-act
 "C-h b" #'embark-bindings)

(elpaca (corfu
         :protocol  https
         :inherit   t
         :depth     1
         :host      github
         :repo      "minad/corfu"
         :files     "extensions/*")
  (global-corfu-mode))

(elpaca (cape
         :repo      "minad/cape"
         :fetcher   github
         :files    
         (:defaults)
         :protocol  https
         :inherit   t
         :depth     1))

(custom-set-variables
 '(completion-cycle-threshold 2)
 '(tab-always-indent 'complete)
 '(corfu-auto t)
 '(corfu-auto-delay 1)
 '(corfu-auto-prefix 3)
 '(corfu-cycle t)
 '(corfu-echo-documentation t)
 '(corfu-popupinfo-delay 1)
 '(corfu-quit-at-boundary t)
 '(corfu-quit-no-match t)
 '(corfu-separator ?_))

(with-eval-after-load 'corfu
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-elisp-block)
  (add-to-list 'completion-at-point-functions #'cape-keyword)
  (add-to-list 'completion-at-point-functions #'cape-symbol))

(general-define-key
 :keymaps 'corfu-map
 "C-s" #'corfu-quit
 "M-t" #'corfu-popupinfo-toggle
 "M-p" #'corfu-popupinfo-scroll-up
 "M-n" #'corfu-popupinfo-scroll-down)

(custom-set-variables
 '(hippie-expand-try-functions-list
   '(yas-hippie-try-expand
     try-expand-all-abbrevs
     try-expand-dabbrev
     try-expand-dabbrev-visible
     try-completion
     try-expand-line
     try-expand-list
     try-complete-file-name
     try-complete-file-name-partially
     try-complete-lisp-symbol
     try-complete-lisp-symbol-partially)))

(general-def global-map "M-/" #'hippie-expand)
