modules/editors/emacs/cfg/config.org
***** Skeleton
#+begin_src emacs-lisp :tangle yes
  (define-skeleton src-block-el
    "Define emacs-lisp source block in org-mode."
    >"#+begin_src emacs-lisp :tangle yes"\n
    >""_ \n
    >"#+end_src"\n
    >"")

  (my-leader-def "s e" #'src-block-el)

#+end_src

***** Yasnippet
#+begin_src emacs-lisp :tangle yes
  (elpaca (yasnippet
	   :repo      "joaotavora/yasnippet"
	   :fetcher   github
	   :files    
	   (:defaults "yasnippet.el" "snippets")))

  (elpaca yasnippet-snippets)

  (add-hook 'prog-mode-hook 'yas-minor-mode)
#+end_src

** Editor
*** Anzu
#+begin_src emacs-lisp :tangle yes
  (elpaca anzu
    (global-anzu-mode))

  (custom-set-variables
   '(anzu-modelighter "")
   '(anzu-deactivate-region t)
   '(anzu-search-threshold 1000)
   '(anzu-replace-threshold 50)
   '(anzu-replace-to-string-separator " => "))

  (my-leader-def global-map
    "a q" #'anzu-query-replace
    "a r" #'anzu-query-replace-regexp
    "a c" #'anzu-query-replace-at-cursor)
#+end_src

*** Buffers
**** iBuffer
#+begin_src emacs-lisp :tangle yes
  (custom-set-variables
   '(uniquify-buffer-name-style 'reverse)
   '(uniquify-separator " • ")
   '(uniquify-after-kill-buffer-p t)
   '(uniquify-ignore-buffers-re "^\\*")
   '(ibuffer-show-empty-filter-groups nil)
   '(ibuffer-expert t)
   '(ibuffer-saved-filter-groups
     '(("default"
        ("EMACS CONFIG"
         (filename . ".emacs.d/config"))
        ("EMACS LISP"
         (mode . emacs-lisp-mode))
        ("DIRED"
         (mode . dired-mode))
        ("ORG"
         (mode . org-mode))
        ("CODE"
         (mode . prog-mode)
         (mode . rustic-mode)
         (mode . zig-mode))
        ("WEBDEV"
         (or
          (mode . html-mode)
          (mode . css-mode)
          (mode . js-mode)
          (mode . ts-mode)))
        ("EPUB/PDF"
         (or
          (mode . pdf-view-mode)
          (mode . nov-mode)))
        ("EWW"
         (mode . eww-mode))
        ("HELM"
         (mode . helm-major-mode))
        ("HELP"
         (or
          (name . "\*Help\*")
          (name . "\*Apropos\*")
          (name . "\*info\*")
          (name . "\*Warnings\*")))
        ("SPECIAL BUFFERS"
         (or
          (name . "\*scratch\*")
          (name . "\*Messages\*")
          (name . "\*straight-process\*")
          (name . "\*direnv\*")))))))

  (add-hook 'ibuffer-mode-hook (lambda ()
                                  (ibuffer-auto-mode t)
                                  (ibuffer-switch-to-saved-filter-groups "default")))

  (general-define-key
   :keymaps 'global-map
   "C-x C-b" #'ibuffer)
#+end_src

**** Mct
#+begin_src emacs-lisp :tangle no
  (elpaca mct
    (mct-mode 1))

  (custom-set-variables
   '(mct-hide-completion-mode-line t)
   '(mct-completion-passlist
     '(consult-buffer
       consult-location
       embark-keybinding
       buffer
       imenu
       kill-ring))
   '(mct-completion-blocklist nil)
   '(mct-remove-shadowed-file-names t)
   '(mct-completion-window-size (cons #'mct-frame-height-third 1))
   '(mct-persist-dynamic-completion nil)
   '(mct-live-update-delay 0.6)
   '(mct-live-completion 'visible))
#+end_src

*** Crux
#+begin_src emacs-lisp :tangle yes
  (elpaca crux)

  (with-eval-after-load 'crux
    (crux-with-region-or-buffer indent-region)
    (crux-with-region-or-buffer untabify)
    (crux-with-region-or-point-to-eol kill-ring-save)
    (defalias 'rename-file-and-buffer 'crux-rename-file-and-buffer))

  (general-def global-map
    "C-a" #'crux-move-beginning-of-line
    "C-x 4 t" #'crux-transpose-windows
    "C-k" #'crux-kill-whole-line)
  (my-leader-def global-map
    "c ;" #'crux-duplicate-and-comment-current-line-or-region
    "c c" #'crux-cleanup-buffer-or-region
    "c d" #'crux-duplicate-current-line-or-region
    "c f" #'crux-recentf-find-file
    "c F" #'crux-recentf-find-directory
    "c k" #'crux-kill-other-buffers
    "c r" #'crux-reopen-as-root-mode
    "c o" #'crux-smart-open-line-above)
#+end_src

*** Dired
#+begin_src emacs-lisp :tangle yes
  (elpaca dired-subtree
    (require 'dired-subtree))
  (elpaca diredfl
    (require 'diredfl))
  (elpaca dired-sidebar
    (require 'dired-x))

  (custom-set-variables
   ;; '(dired-listing-switches "-lGhA1vDpX --group-directories-first")
   '(dired-listing-switches "-alh --group-directories-first")
   '(dired-kill-when-opening-new-dired-buffer t)
   '(dired-recursive-copies 'always)
   '(dired-recursive-deletes 'always)
   '(delete-by-moving-to-trash t)
   '(dired-dwim-target t)
   '(dired-subtree-use-backgrounds nil))

  (add-hook 'dired-mode-hook #'dired-hide-details-mode)
  (add-hook 'dired-mode-hook #'hl-line-mode)

  (global-unset-key (kbd "C-x d"))
  (general-def
    :keymaps 'global-map
   "C-x d d" #'dired
   "C-x d f" #'dired-x-find-file
   "C-x d s" #'dired-sidebar-toggle-sidebar)
  (general-def
    :keymaps 'dired-mode-map
    "<tab>" #'dired-subtree-toggle
    "<backtab>" #'dired-subtree-remove
    "C-TAB" #'dired-subtree-cycle
    "M-RET" #'dired-open-file)

  (defun dired-open-file ()
    "In dired, open the file named on this line."
    (interactive)
    (let* ((file (dired-get-filename nil t)))
      (message "Opening %s..." file)
      (call-process "xdg-open" nil 0 nil file)
      (message "Opening %s done" file)))

  (defun sidebar-toggle ()
    "Toggle both `dired-sidebar’ and `ibuffer-sidebar’"
    (interactive)
    (dired-sidebar-toggle-sidebar))
#+end_src

*** Environment
#+begin_src emacs-lisp :tangle yes
  (elpaca exec-path-from-shell)
  (elpaca envrc
    (envrc-global-mode))

  (custom-set-variables
   '(direnv-always-show-summary nil)
   '(direnv-show-paths-in-summary nil)
   '(exec-path-from-shell-variables
     '("PATH" "MANPATH" "NIX_PATH" "NIX_SSL_CERT_FILE")))

  (with-eval-after-load 'envrc
    (my-leader-def envrc-mode-map
      "e" #'envrc-command-map))
#+end_src

*** Expand Region
#+begin_src emacs-lisp :tangle yes
  (elpaca expand-region)

  (custom-set-variables
   '(expand-region-fast-keys-enabled nil)
   '(er--show-expansion-message t))

  (general-def global-map
   "C-=" #'er/expand-region
   "C-+" #'er/contract-region)
#+end_src

*** Git
#+begin_src emacs-lisp :tangle yes
  (elpaca magit)
  (my-leader-def
   :keymaps 'global-map
   "g s" #'magit-status)
#+end_src

*** iSearch
#+begin_src emacs-lisp :tangle yes
  (custom-set-variables
   '(search-highlight t)
   '(search-whitespace-regexp ".*?")
   '(isearch-lax-whitespace t)
   '(isearch-regexp-lax-whitespace nil)
   '(isearch-lazy-highlight t)
   '(isearch-lazy-count t)
   '(lazy-count-prefix-format nil)
   '(lazy-count-suffix-format " (%s/%s)")
   '(isearch-yank-on-move 'shift)
   '(isearch-allow-scroll 'unlimited)
   '(isearch-repeat-on-direction-change t)
   '(lazy-highlight-initial-delay 0.5)
   '(lazy-highlight-no-delay-length 3)
   '(isearch-wrap-pause t))

  (general-def global-map
    "C-s" #'isearch-forward-regexp
    "C-M-s" #'isearch-forward
    "C-r" #'isearch-backward-regexp
    "C-M-r" #'isearch-backward)
#+end_src

*** Modal
**** God-mode
#+begin_src emacs-lisp :tangle no
  (elpaca god-mode
    (god-mode))

  ;; (custom-set-variables
  ;;  '(god-exempt-major-modes nil)
  ;;  '(god-exempt-predicates nil))

  (defun my/update-cursor-type ()
    "Change cursor type and color according to minor mode."
    (cond
     (god-local-mode
      (set-cursor-color "red")
      (setq cursor-type 'box))
     (buffer-read-only
      (set-cursor-color "gray")
      (setq cursor-type 'box))
     (t
      (set-cursor-color "green")
      (setq cursor-type '(hbar . 2)))))
  (add-hook 'post-command-hook #'my/update-cursor-type)

  (general-def global-map "<escape>" #'god-local-mode)
  (general-def god-local-mode-map
    "." #'repeat
    "i" #'god-local-mode)
#+end_src

*** Parens
**** Rainbow
#+begin_src emacs-lisp :tangle yes
  (elpaca rainbow-delimiters)
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
#+end_src

**** Smartparens
#+begin_src emacs-lisp :tangle yes
  (elpaca smartparens
    (require 'smartparens-config)
    (smartparens-global-mode 1))
  (custom-set-variables
   '(smartparens-strict-mode nil))
#+end_src

*** Projects
#+begin_src emacs-lisp :tangle no

#+end_src

*** Terms
