modules/editors/emacs/cfg/config.org
**** eShell
#+begin_src emacs-lisp :tangle yes
  (setenv "PAGER" "cat")

  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  (add-hook 'eshell-before-prompt-hook
	    (lambda ()
	      (setq xterm-color-preserve-properties t)))

  (setq eshell-prompt-function
	(lambda ()
	  (concat (format-time-string "%Y-%m-%d %H:%M" (current-time))
		  (if (= (user-uid) 0) " # " " λ "))))

  (setq eshell-aliases-file   (concat eshell-directory-name "aliases"))

  (custom-set-variables
   '(eshell-prompt-regexp                    "^[^λ]+ λ ")
   '(eshell-history-size                     1024)
   '(eshell-buffer-maximum-lines             10000)
   '(eshell-hist-ignoredups                  t)
   '(eshell-highlight-prompt                 t)
   '(eshell-prefer-lisp-functions            nil)
   '(eshell-scroll-to-bottom-on-input        'all)
   '(eshell-error-if-no-glob                 t)
   '(eshell-destroy-buffer-when-process-dies t))

  (defun rx/eshell-clear ()
    "Clear the eshell buffer."
    (let ((inhibit-read-only t))
      (erase-buffer)
      (eshell-send-input)))

  (add-hook 'eshell-mode-hook
	    (lambda ()
	      (add-to-list 'eshell-visual-commands "ssh")
	      (add-to-list 'eshell-visual-commands "tail")
	      (add-to-list 'eshell-visual-commands "top")
	      ;; Aliases
	      (eshell/alias "clear" "rx/eshell-clear")))

  (add-hook 'eshell-mode-hook 'eshell-fringe-status-mode)
#+end_src

**** vTerm
#+begin_src emacs-lisp :tangle yes
  (elpaca vterm)
  (general-def global-map
    "C-M-<return>" #'vterm-other-window)
#+end_src

*** Vundo
#+begin_src emacs-lisp :tangle yes
  (elpaca vundo)

  (with-eval-after-load 'vundo
      (setq vundo-glyph-alist vundo-unicode-symbols)
      (set-face-attribute 'vundo-default nil :family "Symbola"))

  (general-def global-map "C-x u" #'vundo)
#+end_src

*** Which-key
#+begin_src emacs-lisp :tangle yes
  (elpaca which-key
    (which-key-mode t))

  (custom-set-variables
   '(which-key-idle-delay 3)
   '(which-key-enable-extended-define-key t)
   '(which-key-side-window-max-width 0.33)
   '(which-key-show-early-on-C-h t)
   '(which-key-show-major-mode t)
   '(which-key-popup-type 'minibuffer)
   '(which-key-side-window-location 'bottom)
   ;; '(which-key-sort-order 'which-key-local-then-key-order)
   '(which-key-sort-order 'which-key-key-order-alpha))
#+end_src

*** Window
**** Moving
#+begin_src emacs-lisp :tangle yes
  (elpaca ace-window)

  (setq aw-keys '(?1 ?2 ?3 ?4 ?5))
  (general-define-key
   :keymaps 'global-map
   [remap other-window] #'ace-window
   "s-o" #'ace-window
   "C-;" #'avy-goto-char
   "C-:" #'avy-goto-word-or-subword-1)
#+end_src

**** Resizing
#+begin_src emacs-lisp :tangle yes
  (elpaca windresize)
  (my-leader-def global-map
    "r" #'windresize)
#+end_src

**** Splitting
#+begin_src emacs-lisp :tangle yes
  (defun split-and-follow-horizontally ()
      (interactive)
      (split-window-below)
      (balance-windows)
      (other-window 1))

    (defun split-and-follow-vertically ()
      (interactive)
      (split-window-right)
      (balance-windows)
      (other-window 1))

  (general-def global-map
    "C-x C-2" #'split-and-follow-horizontally
    "C-x C-3" #'split-and-follow-vertically
    "C-x K" #'kill-buffer-and-window)
#+end_src

**** Placing
#+begin_src emacs-lisp :tangle yes
  (customize-set-variable
   'display-buffer-alist
   '(("\\*e?shell\\*"
      (display-buffer-in-side-window)
      (window-height . 0.3)
      (side . bottom)
      (slot . 1))
     ("\\*\\(ansi-term\\|vterm\\)\\*"
      (display-buffer-in-side-window)
      (window-width . 0.45)
      (side . right)
      (slot . 1))
     ("\\*[Hh]elp\\|[Mm]etahelp\\*"
      (display-buffer-in-side-window)
      (window-height . 0.25)
      (side . bottom)
      (slot . 1))
     ("\\*\\(Backtrace\\|Warnings\\|Compile-Log\\|Messages\\)\\*"
      (display-buffer-in-side-window)
      (window-height . 0.25)
      (side . bottom)
      (slot . 0))
     ("\\*Faces\\*"
      (display-buffer-in-side-window)
      (window-height . 0.25)
      (side . bottom)
      (slot . 1))
     ("\\*contents\\*"
      (display-buffer-in-side-window)
      (window-height . 0.25)
      (side . bottom)
      (slot . 2))))
#+end_src

** Code
*** Langs
**** Rust
#+begin_src emacs-lisp :tangle yes
  (elpaca rustic)
  (custom-set-variables
   '(rustic-lsp-client 'eglot)
   '(rust-format-on-save t))
  (add-hook 'rustic-mode-hook 'eglot-ensure)
#+end_src

**** Zig
#+begin_src emacs-lisp :tangle yes
  (elpaca zig-mode)
  (add-to-list 'auto-mode-alist '("\\.zig\\’" . zig-mode))
  (add-hook 'zig-mode-hook 'eglot-ensure)
#+end_src

**** Web
***** Emmet
#+begin_src emacs-lisp :tangle no

#+end_src

***** Css
#+begin_src emacs-lisp :tangle no

#+end_src

***** Js/Ts
#+begin_src emacs-lisp :tangle yes
  (elpaca typescript-mode)

  (with-eval-after-load 'typescript-mode
    (add-hook 'typescript-mode-hook #'eglot-ensure))
#+end_src

***** Web-mode
#+begin_src emacs-lisp :tangle no

#+end_src

*** Modes
**** Ba(sh)
#+begin_src emacs-lisp :tangle yes
  (add-to-list 'auto-mode-alist '("\\.sh\\’" . sh-mode))
  (add-hook 'sh-mode-hook 'eglot-ensure)
#+end_src

**** Json
#+begin_src emacs-lisp :tangle yes
  (elpaca json-mode)
  (add-to-list 'auto-mode-alist '("\\.json\\'" . json-mode))
#+end_src

**** Markdown
#+begin_src emacs-lisp :tangle yes
  (elpaca markdown-mode)

  (add-to-list 'auto-mode-alist '("\\.\\(?:md\\|markdown\\|mkd\\)\\'" . markdown-mode))
#+end_src

**** Nix
#+begin_src emacs-lisp :tangle yes
  (elpaca nix-mode)
  (add-to-list 'auto-mode-alist '("\\.nix\\’" . nix-mode))
  (with-eval-after-load 'eglot
    (add-to-list 'eglot-server-programs '(nix-mode . ("nil"))))
  (add-hook 'nix-mode-hook 'eglot-ensure)
#+end_src

**** Toml
#+begin_src emacs-lisp :tangle yes
  (elpaca toml-mode)
  (add-to-list 'auto-mode-alist '("\\.toml\\'" . toml-mode))
#+end_src

**** Yaml
#+begin_src emacs-lisp :tangle yes
  (elpaca yaml-mode)
  (add-to-list 'auto-mode-alist '("\\.yaml\\'" . yaml-mode))
#+end_src

*** Syntax
**** FlyMake
#+begin_src emacs-lisp :tangle no

#+end_src

**** Debuger
#+begin_src emacs-lisp :tangle no

#+end_src

** Org
*** Org-mode
#+begin_src emacs-lisp :tangle yes
  (elpaca org-contrib)
  (custom-set-variables
   '(org-directory "~/doc/org/")
   '(org-startup-with-inline-images (display-graphic-p))
   '(org-startup-align-all-tables t)
   '(org-use-speed-commands t)
   '(org-use-fast-todo-selection 'expert)
   '(org-fast-tag-selection-single-key 'expert)
   '(org-hide-emphasis-markers t)
   '(org-adapt-indentation t)
   '(org-confirm-babel-evaluate t)
   '(org-pretty-entities t)
   '(org-support-shift-select t)
   '(org-edit-src-content-indentation 2)
   '(org-src-tab-acts-natively t)
   '(org-src-fontify-natively t)
   '(org-src-preserve-indentation nil)
   '(org-src-window-setup 'current-window)
   '(org-src-strip-leading-and-trailing-blank-lines t)
   '(org-todo-keywords
     '((sequence "IDEA(i)" "TODO(t)" "STARTED(s)" "NEXT(n)" "WAITING(w)" "|" "DONE(d)")
       (sequence "|" "CANCELED(c)" "DELEGATED(l)" "SOMEDAY(f)"))))

  (add-hook 'org-mode-hook (lambda ()
                             (org-indent-mode)
                             (auto-fill-mode)
                             (org-superstar-mode)))
#+end_src

*** Org-capture
#+begin_src emacs-lisp :tangle no

#+end_src

*** Org-superstar
#+begin_src emacs-lisp :tangle yes
  (elpaca org-superstar)
  (custom-set-variables
   '(org-superstar-headline-bullets-list
     ;; '("☰" "☷" "☵" "☲"  "☳" "☴"  "☶"  "☱")
     '("◉" "●" "○" "○" "○" "○" "○"))
   '(org-superstar-leading-bullet " "))
#+end_src

** Others
*** Academic
