modules/editors/emacs/cfg/config.el
 '(denote-directory "~/doc/denote")
 '(denote-rename-buffer-mode t)
 '(denote-infer-keywords t)
 '(denote-sort-keywords t)
 '(denote-backlinks-show-context t)
 '(denote-known-keywords '("nixos" "code" "work"))
 '(denote-file-type nil))

(add-hook 'find-file-hook 'denote-link-buttonize-buffer)
(add-hook 'dired-mode-hook 'denote-dired-mode)

(my-leader-def
  :keymaps 'global-map
  "n j" #'my-denote-journal
  "n n" #'denote
  "n z" #'denote-signature 		;zettelkasten mnemonic
  "n t" #'denote-template
  "n N" #'denote-type
  "n d" #'denote-date
  "n s" #'denote-subdirectory
  "n i" #'denote-link
  "n I" #'denote-link-add-links
  "n f f" #'denote-link-find-file
  "n f b" #'denote-link-find-backlink
  "n r" #'denote-rename-file
  "n R" #'denote-rename-file-using-front-matter)

(defun my-denote-journal ()
  "Create an entry tagged 'journal' with the date as its title.
If a journal for the current day exists, visit it.  If multiple
entries exist, prompt with completion for a choice between them.
Else create a new file."
  (interactive)
  (let* ((today (format-time-string "%A %e %B %Y"))
         (string (denote-sluggify today))
         (files (denote-directory-files-matching-regexp string)))
    (cond
     ((> (length files) 1)
      (find-file (completing-read "Select file: " files nil :require-match)))
     (files
      (find-file (car files)))
     (t
      (denote
       today
       '("journal"))))))

(setq custom-file (expand-file-name "customs.el" user-emacs-directory))
;; (add-hook 'elpaca-after-init-hook (lambda () (load custom-file 'noerror)))

;;; config.el ends here.
